
### OOP란?

객체지향 프로그래밍

객체 지향 프로그래밍은 컴퓨터 프로그래밍 패러다임중 하나로, **프로그래밍에서 필요한 데이터를 추상화시켜 상태와 행위를 가진 객체를 만들고 그 객체들 간의 유기적인 상호작용을 통해 로직을 구성하는 프로그래밍 방법**
이다.

사물을 객체로 형성하여 공통점을 갖는 모든 곳에서 상속받는 객체 내부의 모든 로직을 캡슐화 합니다. 의도하지 않아도 상속했다는 이유로 모든 속성과 행위를 공유해야하며, 복잡한 상속 구조를 지닌 클래스를 상속했다면 원하는 클래스를 참조해야 할때 다운캐스팅을 해야 합니다. 그리고 가장 큰 단점으로 superClass만 상속할 수 있다는 점으로 추후 기능도 확정될 수 있는데 이에 따라 복잡도가 높아지고 관리도 어려워지게 됩니다.

객체 지향 설계의 5원칙 SOLID

- SRP (Single Responsibility Principle) : 단일 책임 원칙
    클래스(객체)는 단 하나의 책임만 가져야 한다는 원칙, 여기서 책임 이란 하나의 기능 담당
    즉, 하나의 클래스는 하나의 기능 담당하여 하나의 책임을 수행하는데 집중 되도록 클래스를 따로따로 여러개 설계해야한다는 원칙
    만약 하나의 클래스에 기능(책임)이 여러개 있다면 기능 변경이 일어났을때 수정해야할 코드가 많아진다.  A를 고쳤더니 연결된 B, C 다시 돌아가서 A를 수정해야하는 책임이 순환되는 형태가 되버린다. 따라서 SRP 원칙을 따름으로써 한 책임의 변경으로부터 다른 책임의 변경으로의 연쇄작용을 극복할 수 있게 된다.
    단일 책임 원칙의 목적은 프로그램의 유지보수성을 높이기 위한 설계 기법이다.
    이때 책임 범위는 정해진 것이 아니라 어떤 프로그램이냐에 따라 개발자마다 달라질수 있다.
    쉽게 말해 하나의 클래스로 너무 많은 일을 하지 말고 딱 한 가지 책임만 수행하라는 뜻으로 보면 된다.

- OCP (Open Closed Principle) : 개방 폐쇄 원칙
    클래스는 확장에 열려있어야 하며, 수정에는 닫혀있어야 한다를 뜻한다.
    - 확장에 열려있다 - 새로운 변경 사항이 발생했을 때 유연하게 코드를 추가함으로써 큰 힘을 들이지 않고 애플리케이션의 기능을 확장 할 수 있다.
    - 수정에 닫혀 있다 - 새로운 변경사항이 발생했을 때 객체를 직접적으로 수정을 제한함.
    추상화 사용을 통한 관계 구축을 권장을 의미하는 것
    즉, 다형성과 확장을 가능하게 하는 객체지향의 장점을 극대화 하는 기본적인 설계 원칙

- LSP (Liskov Substitution Principle) : 리스코프 치환 원칙
    서브타입은 언제나 부모타입으로 교체할 수 있어야 한다는 원칙
    다형성 원리를 이용하기 위한 원칙으로 상위 클래스 타입으로 객체를 선언하여 하위 클래스의 인스턴스를 받으면, 업캐스팅된 상태에서 부모의 메서드를 사용해도 동작이 의도대로 흘러가야 하는것을 의미한다.

- ISP (Interface Segregation Principle) : 인터페이스 분리 원칙
    인터페이스를 각각 사용에 맞게끔 각각 분리해야한다는 설계 원칙
    SRP가 클래스이 단일 책임을 강조한다면 ISP는 인터페이스의 단일 책임을 강조하는것으로 보면 된다.
    인터페이스를 사용하는 클라이언트를 기준으로 분리함으로써 클라이언트의 목적과 용도에 적합한 인터페이스만을 제공하는것이 목표
    다만, 한번 인터페이스를 분리하여 구성해놓고 나중에 수정사항이 생겨서 또 인터페이스를 분리하면 안된다.

- DIP ( Dependency Inversion Principle) : 의존 역전 원칙
    어떤 Class를 참조해서 사용해야하는 상황이 생긴다면, 그 class를 직접 참조하는것이 아니라 그 대상의 상위요소(추상 클래스or인터페이스)로 참조하라는 원칙
    즉, 구현 클래스에 의존하지 말고 인터페이스에 의존하라는 뜻


[https://inpa.tistory.com/entry/OOP-💠-객체-지향-설계의-5가지-원칙-SOLID](https://inpa.tistory.com/entry/OOP-%F0%9F%92%A0-%EA%B0%9D%EC%B2%B4-%EC%A7%80%ED%96%A5-%EC%84%A4%EA%B3%84%EC%9D%98-5%EA%B0%80%EC%A7%80-%EC%9B%90%EC%B9%99-SOLID)

객체지향의 중요한 개념 다형성(Polymorphism)

- 클래스의 상속은 Subclassing 이라고도 하는데, 이는 기존에 구현되어 있는 부모 클래스를 확장 및 변형하는 것을 말한다.
- 주로 Override / Overriding 을 의미
    - 부모 클래스에서 상속 받은 메서드를 그대로 사용하지 않고, 자식 클래스에 알맞게 변경해서 사용

### OOP의 장점

- 코드 재사용이 용이하다
    - 기존에 만들어진 클래스를 재사용할 수 있고 상속을 통해 확장 가능
- 유지 보수가 편리
    - 수정해야 할 부분이 클래스 내부에 있으므로 해당 부분만 수정하면 됨
- 대형 프로젝트에 적합
    - 클래스 단위로 모듈화 시켜서 개발시 업무 분담의 편리성 향상

### OOP의 단점

- superClass에 종속적이다.
superClass를 상속받는 구조이기 때문에, subClass는 자신에게 필요없는 변수나 함수를 무조건 물려받을 수 밖에 없다. 이렇게 되면 subClass에서 필요한 코드들이 무한 추가되면서 무겁고 지저분한 클래스가 될 가능성이 크다.
- valueType을 사용할 수 없다.
swift에서 Class는 Reference Type(참조 타입)이나 상속구조를 사용하기 위해서는 ValueType으로 정의해 무방한 모델들을 굳이 참조타입으로 정의해야하는 불편이 있다.

---

## POP(Protocol-Oriented Programming)란?

프로토콜지향 프로그래밍

필요한 부분만 프로토콜로 분리해서 만들 수 있고 다중 프로토콜을 구현할 수 있습니다. 게다가 프로토콜 규칙을 class, struct, enum에 적용할 수 있기 때문에 확장 부분에서도 OOP보다 유연합니다.

### POP의 장점

- 기능의 모듈화가 명확해집니다.
필요한 부분만 프로토콜로 분리할 수 있고, 다중 프로토콜을 구현할 수도 있다.
- 수평적인 기능의 확장
다수의 프로토콜을 따르는 것이 가능해진다. 또한 상속의 개념이 아니기 때문에 다중 상속의 문제점에서 자유롭다.
- 값 타입의 상속 **(상속의 개념이 아닌데….?)**
Swift의 기본타입(String, Int, Float 등) 대부분 구조체로 구현되어 있다.
Protocol과 Extension 사용시, 위처럼 상속이 되지 않는 타입들에게 공통된 기능을 줄 수 있다.

### POP를 유용하게 쓸 수 있는 예시

- 참조타입 뿐 아니라, 값 타입에도 동일한 기능을 구현하고 싶을 때
- 객체간 메세지를 전달하고 싶을 때

```swift
protocol Receiveable {
    func received(data: Any, from: Sendable)
}

extension Receiveable {
    func received(data: Any, from: Sendable) {
        print("\(self) received \(data) from \(from)")
    }
}

protocol Sendable {
    var from: Sendable { get }
    var to: Receiveable? { get }

    func send(data: Any)
}

extension Sendable {
    var from: Sendable { return self }

    func send(data: Any) {
        guard let reciver: Receiveable = self.to else { return }

        reciver.received(data: data, from: self.from)
    }
}

// 수신, 발신 모두 가능한 메일
class Mail: Receiveable, Sendable {
    var to: Receiveable?
}

let myMail = Mail()
let yourMail = Mail()

myMail.to = yourMail
myMail.send(data: "안녕!") // myMail 이 yourMail 에게 "안녕!" 이라는 메세지 전송
```

OOP에서는 Subclassing, Overloading, Overriding을 통해 Polymorphism을 구현한다. 공통 코드(function 등)는 슈퍼클래스에서 제공해준다. 서브클래스는 그것을 그대로 활용하거나, 필요 시 자신이 따로 구현한 코드로 덮어쓴다.

POP에서는 프로토콜을 통해 Polymorphism을 구현한다. 프로토콜 확장 등을 통해 공통 코드(function 등)를 제공해줄 수 있다.

> 참조
> [https://velog.io/@jee/OOP와-POP](https://velog.io/@jee/OOP%EC%99%80-POP)

> [https://velog.io/@haero_kim/객체지향-프로그래밍-이해하기](https://velog.io/@haero_kim/%EA%B0%9D%EC%B2%B4%EC%A7%80%ED%96%A5-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D-%EC%9D%B4%ED%95%B4%ED%95%98%EA%B8%B0)

> [https://zetal.tistory.com/entry/swift-기초문법-25-프로토콜-지향-프로그래밍Protocol-Oriented-Language](https://zetal.tistory.com/entry/swift-%EA%B8%B0%EC%B4%88%EB%AC%B8%EB%B2%95-25-%ED%94%84%EB%A1%9C%ED%86%A0%EC%BD%9C-%EC%A7%80%ED%96%A5-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8DProtocol-Oriented-Language)

> [https://jinshine.github.io/2018/09/11/Swift/18.프로토콜 지향 프로그래밍(Protocol-Oriented Programming)/](https://jinshine.github.io/2018/09/11/Swift/18.%ED%94%84%EB%A1%9C%ED%86%A0%EC%BD%9C%20%EC%A7%80%ED%96%A5%20%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D(Protocol-Oriented%20Programming)/)

> https://wlaxhrl.tistory.com/77

> [https://velog.io/@jacob0122/객체-지향-프로그래밍이란](https://velog.io/@jacob0122/%EA%B0%9D%EC%B2%B4-%EC%A7%80%ED%96%A5-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D%EC%9D%B4%EB%9E%80)

> https://velog.io/@koyo/development-common-sense-0

> https://jeong-pro.tistory.com/95

